app/controllers/api/players_controller.rb

    def update
        debugger
        @player = Player.find(params[:id])
        if @player.update(player_params)
---
SELECT  "players".* FROM "players" WHERE "players"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "players" SET "score" = $1 WHERE "players"."id" = $2  [["score", 1], ["id", 1]]